experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run1_vclients32_workerthreads32_client2_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      206785 ops,    3097 (avg:    2953) ops/sec, 12.21MB/sec (avg: 11.64MB/sec), 10.32 (avg: 10.83) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2953.81          ---          ---     10.82900     11921.64 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2953.81         0.00         0.00     10.82900     11921.64 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.00
SET       1.200         0.00
SET       1.300         0.00
SET       1.400         0.00
SET       1.500         0.01
SET       1.600         0.01
SET       1.700         0.02
SET       1.800         0.02
SET       1.900         0.04
SET       2.000         0.05
SET       2.100         0.07
SET       2.200         0.10
SET       2.300         0.12
SET       2.400         0.15
SET       2.500         0.18
SET       2.600         0.22
SET       2.700         0.26
SET       2.800         0.32
SET       2.900         0.39
SET       3.000         0.46
SET       3.100         0.54
SET       3.200         0.63
SET       3.300         0.72
SET       3.400         0.80
SET       3.500         0.89
SET       3.600         0.99
SET       3.700         1.11
SET       3.800         1.20
SET       3.900         1.32
SET       4.000         1.43
SET       4.100         1.54
SET       4.200         1.65
SET       4.300         1.77
SET       4.400         1.89
SET       4.500         2.00
SET       4.600         2.12
SET       4.700         2.25
SET       4.800         2.37
SET       4.900         2.51
SET       5.000         2.65
SET       5.100         2.79
SET       5.200         2.93
SET       5.300         3.08
SET       5.400         3.24
SET       5.500         3.40
SET       5.600         3.58
SET       5.700         3.78
SET       5.800         3.96
SET       5.900         4.16
SET       6.000         4.37
SET       6.100         4.61
SET       6.200         4.86
SET       6.300         5.12
SET       6.400         5.36
SET       6.500         5.64
SET       6.600         5.93
SET       6.700         6.27
SET       6.800         6.64
SET       6.900         7.00
SET       7.000         7.42
SET       7.100         7.86
SET       7.200         8.35
SET       7.300         8.87
SET       7.400         9.41
SET       7.500        10.01
SET       7.600        10.63
SET       7.700        11.32
SET       7.800        12.03
SET       7.900        12.76
SET       8.000        13.55
SET       8.100        14.42
SET       8.200        15.38
SET       8.300        16.39
SET       8.400        17.44
SET       8.500        18.60
SET       8.600        19.83
SET       8.700        21.09
SET       8.800        22.49
SET       8.900        24.05
SET       9.000        25.72
SET       9.100        27.60
SET       9.200        29.62
SET       9.300        31.72
SET       9.400        34.08
SET       9.500        36.48
SET       9.600        39.09
SET       9.700        41.75
SET       9.800        44.40
SET       9.900        47.04
SET      10.000        59.17
SET      11.000        71.57
SET      12.000        78.99
SET      13.000        84.51
SET      14.000        88.70
SET      15.000        91.85
SET      16.000        94.34
SET      17.000        96.16
SET      18.000        97.29
SET      19.000        98.11
SET      20.000        98.61
SET      21.000        98.90
SET      22.000        99.07
SET      23.000        99.19
SET      24.000        99.27
SET      25.000        99.31
SET      26.000        99.35
SET      27.000        99.41
SET      28.000        99.44
SET      29.000        99.48
SET      30.000        99.51
SET      31.000        99.53
SET      32.000        99.54
SET      33.000        99.56
SET      34.000        99.58
SET      35.000        99.60
SET      36.000        99.61
SET      37.000        99.64
SET      38.000        99.66
SET      39.000        99.69
SET      40.000        99.72
SET      41.000        99.76
SET      42.000        99.78
SET      43.000        99.79
SET      44.000        99.81
SET      45.000        99.84
SET      46.000        99.86
SET      47.000        99.88
SET      48.000        99.91
SET      49.000        99.92
SET      50.000        99.92
SET      51.000        99.92
SET      52.000        99.93
SET      53.000        99.93
SET      54.000        99.93
SET      56.000        99.93
SET      57.000        99.93
SET      58.000        99.94
SET      59.000        99.94
SET      60.000        99.95
SET      61.000        99.95
SET      62.000        99.95
SET      63.000        99.96
SET      64.000        99.96
SET      65.000        99.96
SET      66.000        99.96
SET      67.000        99.96
SET      68.000        99.96
SET      69.000        99.96
SET      96.000        99.96
SET      99.000        99.96
SET     100.000        99.97
SET     110.000        99.98
SET     120.000        99.98
SET     130.000        99.98
SET     230.000        99.99
SET     240.000        99.99
SET     250.000       100.00
SET     270.000       100.00
SET     280.000       100.00
---
---