experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run1_vclients4_workerthreads16_client1_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       79245 ops,    1087 (avg:    1132) ops/sec, 4.29MB/sec (avg: 4.46MB/sec),  3.67 (avg:  3.53) msec latency

1         Threads
4         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1132.04          ---          ---      3.52900      4568.93 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1132.04         0.00         0.00      3.52900      4568.93 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.490         0.00
SET       0.500         0.00
SET       0.510         0.01
SET       0.520         0.01
SET       0.530         0.01
SET       0.540         0.01
SET       0.550         0.02
SET       0.560         0.03
SET       0.570         0.05
SET       0.580         0.07
SET       0.590         0.10
SET       0.600         0.14
SET       0.610         0.19
SET       0.620         0.24
SET       0.630         0.30
SET       0.640         0.39
SET       0.650         0.52
SET       0.660         0.67
SET       0.670         0.85
SET       0.680         1.02
SET       0.690         1.25
SET       0.700         1.51
SET       0.710         1.82
SET       0.720         2.13
SET       0.730         2.51
SET       0.740         2.89
SET       0.750         3.29
SET       0.760         3.77
SET       0.770         4.32
SET       0.780         4.88
SET       0.790         5.48
SET       0.800         6.12
SET       0.810         6.77
SET       0.820         7.49
SET       0.830         8.27
SET       0.840         8.98
SET       0.850         9.72
SET       0.860        10.57
SET       0.870        11.43
SET       0.880        12.28
SET       0.890        13.15
SET       0.900        14.03
SET       0.910        14.91
SET       0.920        15.77
SET       0.930        16.71
SET       0.940        17.63
SET       0.950        18.60
SET       0.960        19.51
SET       0.970        20.40
SET       0.980        21.31
SET       0.990        22.19
SET       1.000        27.15
SET       1.100        34.89
SET       1.200        40.86
SET       1.300        45.13
SET       1.400        48.12
SET       1.500        50.31
SET       1.600        51.94
SET       1.700        53.12
SET       1.800        54.08
SET       1.900        54.83
SET       2.000        55.50
SET       2.100        56.08
SET       2.200        56.54
SET       2.300        56.96
SET       2.400        57.29
SET       2.500        57.62
SET       2.600        57.95
SET       2.700        58.23
SET       2.800        58.52
SET       2.900        58.80
SET       3.000        59.09
SET       3.100        59.38
SET       3.200        59.63
SET       3.300        59.89
SET       3.400        60.15
SET       3.500        60.41
SET       3.600        60.65
SET       3.700        60.89
SET       3.800        61.14
SET       3.900        61.39
SET       4.000        61.68
SET       4.100        61.96
SET       4.200        62.26
SET       4.300        62.59
SET       4.400        62.97
SET       4.500        63.32
SET       4.600        63.70
SET       4.700        64.15
SET       4.800        64.58
SET       4.900        64.98
SET       5.000        65.39
SET       5.100        65.85
SET       5.200        66.30
SET       5.300        66.79
SET       5.400        67.31
SET       5.500        67.87
SET       5.600        68.50
SET       5.700        69.11
SET       5.800        69.81
SET       5.900        70.57
SET       6.000        71.41
SET       6.100        72.28
SET       6.200        73.21
SET       6.300        74.27
SET       6.400        75.38
SET       6.500        76.50
SET       6.600        77.72
SET       6.700        78.94
SET       6.800        80.18
SET       6.900        81.62
SET       7.000        82.96
SET       7.100        84.33
SET       7.200        85.73
SET       7.300        87.06
SET       7.400        88.44
SET       7.500        89.53
SET       7.600        90.52
SET       7.700        91.35
SET       7.800        92.10
SET       7.900        92.81
SET       8.000        93.37
SET       8.100        93.87
SET       8.200        94.24
SET       8.300        94.60
SET       8.400        94.89
SET       8.500        95.15
SET       8.600        95.42
SET       8.700        95.64
SET       8.800        95.82
SET       8.900        96.03
SET       9.000        96.20
SET       9.100        96.37
SET       9.200        96.49
SET       9.300        96.64
SET       9.400        96.77
SET       9.500        96.88
SET       9.600        97.03
SET       9.700        97.18
SET       9.800        97.29
SET       9.900        97.39
SET      10.000        97.90
SET      11.000        98.54
SET      12.000        98.90
SET      13.000        99.17
SET      14.000        99.43
SET      15.000        99.68
SET      16.000        99.82
SET      17.000        99.89
SET      18.000        99.92
SET      19.000        99.95
SET      20.000        99.97
SET      21.000        99.98
SET      22.000        99.99
SET      23.000        99.99
SET      24.000        99.99
SET      26.000        99.99
SET      29.000        99.99
SET      32.000        99.99
SET      34.000        99.99
SET      35.000        99.99
SET      49.000       100.00
SET      52.000       100.00
SET      60.000       100.00
---
---